<script>
  import NewItemIcon from "@/components/NewItemIcon.svelte";
</script>

<svelte:head>
  <title>あいわか文庫</title>
</svelte:head>

<h1>書庫へようこそ</h1>
<h2>概要</h2>
<p>あいわかが編集した板書や文書をまとめたウェブサイトです。 閲覧にはログインが必要です。</p>

<h2>意見・修正について</h2>
<p>
  文書の修正等を行いたい場合は、配布ページにおいて修正リクエストを行ってください。
  継続的に参加したい、または自分で修正を行いたい場合はGitHubリポジトリへの参加申請を行ってください。
  （なお、GitHubリポジトリを作っていない文書もあります。現在はその判別はできませんのでご了承ください。）
  リクエストの反映に時間を要する、またはリクエストを拒否する場合がありますがご了承ください。
  リクエストが受理または拒否された場合は該当するステータスメッセージが変化しますのでご確認ください。
</p>

<h2>このような形式を取る目的</h2>
<p>
  ここの文書は講義の板書等を含みます。
  本来公開されるべきではないものですが、広く利用していただきたいという思いもあります。
  したがって、利便性を保ちつつ、利用者の所属等を明確にすることを念頭に置いています。
  あまりに私の知るところから逸脱した方の利用は予告なく停止する可能性があることをご容赦ください。
  基本的にツイッター等の知り合いは大丈夫です。
</p>

<h2>更新履歴</h2>
<ul>
  <li>2022.05.14：初版作成</li>
  <li>2022.05.16：リクエスト機能を実装</li>
  <li>2022.06.12：リクエストバッヂのスタイルを調整</li>
  <li>2022.08.03：</li>
  <ul>
    <li>ユーザーページを追加し、リクエスト一覧等の機能を追加</li>
    <li>それに伴いログアウト機能等を分離</li>
    <li>一部のページにログイン状況に関わらず遷移できていたのを修正</li>
    <li>軽微なバグ修正</li>
  </ul>
  <li>2022.08.05：</li>
  <ul>
    <li>文書のお気に入りリスト機能を追加</li>
    <li>ボタンデザインの変更</li>
  </ul>
  <li>
    2022.10.04：直近一週間以内に更新された文書に<NewItemIcon />アイコンがつく機能を追加.
  </li>
</ul>
